# include <stdio.h>

int main()
{
    // 从键盘输入一指定金额（以元为单位，如345），然后输出支付该金额的各种面额的人民币数量，
    // 显示100元，50元，20元，10元，5元，1元各多少张，要求尽量使用大面额的钞票。

    int money;
    scanf("%d", &money);

    int n100, n50, n20, n10, n5, n1;

    n100 = money/100; // 7
    n50 = (money - n100 * 100) / 50; // 0
    n20 = ((money - n100 * 100) - n50 * 50) / 20; // 1
    n10 = (((money - n100 * 100) - n50 * 50) - n20 * 20) / 10; // 1
    n5 = ((((money - n100 * 100) - n50 * 50) - n20 * 20) - n10 * 10) / 5; // 1
    n1 = (((((money - n100 * 100) - n50 * 50) - n20 * 20) - n10 * 10) - n5 * 5) / 1; // 0
    


    printf("%d\n",n100);
    printf("%d\n",n50);
    printf("%d\n",n20);
    printf("%d\n",n10);
    printf("%d\n",n5);
    printf("%d\n",n1);
    
}