#include <iostream>
using namespace std;

// 给一段英文短文，单词之间以空格分隔（每个单词应包括其前后紧邻的标点符号）。请将短文重新排版，要求如下：
// 每行不超过80个字符；每个单词居于同一行上；在同一行的单词之间以一个空格分隔；行首和行尾都没有空格。
int main() 
{
    int m = 0;
    int i = 0, j = 0, k = 0, c = 0;
    int b[1000] = {}; //存放每个单词的字符数
    char a[1000][40] = {}; //存放输入的短文
    cin >> m; //输入短文的单词数
    for(i = 0; i < m; i++) cin >> a[i]; 
    for(i = 0; i < m; i++) //计算每个单词的字符数
        for(j = 0;; j++){ 
            if(a[i][j] != '\0') b[i]++;
            else break;
        }
    for(i = 0; i < m; i++){ //输出短文
        k = k + b[i] + 1; //累计字符，空格算1
        if(k > 81) { //字符数大于80，输出
            for(j = c; j < i - 1; j++) //c 输出单词数总和
                cout << a[j] << " "; //循环输出单词和空格，
            cout << a[j] << endl; //输出k<80的最后一个单词，并换行
            k = 0, c = i, i--; //i--与j<i-1对应，使每一行的输出数不大于80
        }
    } 
    for(j = c; j < i - 1; j++)
        cout << a[j] << " ";
    cout << a[j] << endl;
    return 0;
}
