/*
我国有 4 大淡水湖。

A 说：洞庭湖最大，洪泽湖最小，鄱阳湖第三。
B 说：洪泽湖最大，洞庭湖最小，鄱阳湖第二，太湖第三。
C 说：洪泽湖最小，洞庭湖第三。
D 说：鄱阳湖最大，太湖最小，洪泽湖第二，洞庭湖第三。
已知这 4 个湖的大小均不相等，4 个人每人仅答对一个，请编程按照鄱阳湖、洞庭湖、太湖、洪泽湖的顺序给出他们的大小排名。

*/

// https://blog.csdn.net/FAAGuanG/article/details/100834502

#include<iostream>
using namespace std;

int main()
{
	int a, b, c, d;
	a = b = c = d = 0;

	for (a = 1; a <= 4; a++) {//洞庭湖可能的名次
		for (b = 1; b <= 4; b++) {//洪泽湖可能的名次
			for (c = 1; c <= 4; c++) {//鄱阳湖可能的名次
				for (d = 1; d <= 4; d++) {//太湖可能的名次

					if ((a != b && a != c && a != d && b != c && b != d && c != d)
						&& ((a == 1) + (b == 4) + (c == 3) == 1) //若为False则为0，相加为1说明只有一个True
						&& ((b == 1) + (a == 4) + (c == 2) + (d == 3) == 1)
						&& ((b == 4) + (a == 3) == 1)
						&& ((c == 1) + (d == 4) + (b == 2) + (a == 3) == 1)) {
						//按顺序输出
						cout << c << endl;
						cout << a << endl;
						cout << d << endl;
						cout << b << endl;
					}
				}
			}
		}
	}
	return 0;
	
}
